#### Terraform plan for AWS: `success`

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudfront_cache_policy.cors will be created
  + resource "aws_cloudfront_cache_policy" "cors" {
      + comment     = "Same as Managed-CachingOptimized, but allow CORS headers"
      + default_ttl = 86400
      + etag        = (known after apply)
      + id          = (known after apply)
      + max_ttl     = 31536000
      + min_ttl     = 1
      + name        = "CORS Policy"

      + parameters_in_cache_key_and_forwarded_to_origin {
          + cookies_config {
              + cookie_behavior = "none"
            }

          + headers_config {
              + header_behavior = "whitelist"

              + headers {
                  + items = [
                      + "Access-Control-Request-Headers",
                      + "Access-Control-Request-Method",
                      + "Authorization",
                      + "Origin",
                    ]
                }
            }

          + query_strings_config {
              + query_string_behavior = "none"
            }
        }
    }

  # aws_cloudfront_distribution.dist will be updated in-place
  ~ resource "aws_cloudfront_distribution" "dist" {
        id                             = "E2X3ZA9V8SDUFL"
        tags                           = {}
        # (18 unchanged attributes hidden)

      ~ default_cache_behavior {
          + cache_policy_id        = (known after apply)
            # (11 unchanged attributes hidden)

          - forwarded_values {
              - headers                 = [
                  - "Access-Control-Request-Headers",
                  - "Access-Control-Request-Method",
                  - "Origin",
                ] -> null
              - query_string            = false -> null
              - query_string_cache_keys = [] -> null

              - cookies {
                  - forward           = "none" -> null
                  - whitelisted_names = [] -> null
                }
            }
        }



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.resume_backend will be updated in-place
  ~ resource "aws_lambda_function" "resume_backend" {
        id                             = "ResumeBackend"
      ~ last_modified                  = "2021-06-19T01:57:13.424+0000" -> (known after apply)
      ~ source_code_hash               = "JKQ5IoqtNolYLfxiMNEAwhWb/2TgYeJTzMfGBczJN2E=" -> "OHDPufD5ifJr2Wtsb6W7dxRDnVYqS9NRTHMjgG5rg/k="
        tags                           = {}
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.

```

</details>

*Pusher: @bkimbrough88, Action: `pull_request`, Workflow: `Resume Backend CI`*